In [1]:
import numpy as np
import pandas as pd

In [2]:
lst=[['a',24],['b',45],['c',56],['v',45]]

#### 2)Make a Pandas DataFrame with two-dimensional list

In [5]:
df=pd.DataFrame(lst,columns=["name","marks"])

#### 3)Reset the column names as Category and cost; Index name as Premium,Deluxe,Super,Basic in above df.

In [7]:
df.rename(columns={"name":"category","marks":"cost"})

  category  cost
0        a    24
1        b    45
2        c    56
3        v    45

In [8]:
df.index=['Premium','Deluxe','Super','Basic']
df

        name  marks
Premium    a     24
Deluxe     b     45
Super      c     56
Basic      v     45

#### 4) Write a code to select row with maximum & Minimum value in Pandas Dataframe

In [9]:
dict1 = {'Driver': ['Hamilton', 'Vettel', 'Raikkonen'],
         'Points': [408, 320, 251],
         'Age': [33, 31, 39]}

In [12]:
df2=pd.DataFrame(dict1)

In [13]:
df2.max()

Driver    Vettel
Points       408
Age           39
dtype: object

In [14]:
df2.min()

Driver    Hamilton
Points         251
Age             31
dtype: object

#### 5) Select row/s having Points>300 in above df

In [17]:
df2[df2["Points"]>300]

     Driver  Points  Age
0  Hamilton     408   33
1    Vettel     320   31

#### 6 Find mean,sum of age column wise.

In [22]:
df2[["Points","Age"]].mean()

Points    326.333333
Age        34.333333
dtype: float64

In [23]:
df2[["Points","Age"]].sum()

Points    979
Age       103
dtype: int64

#### 7) Create a df with columns as name, score1,score2 and fetch the difference between score 1 and 2.

In [25]:
df1 = { 'Name':['George','Andrea','micheal',
                'maggie','Ravi','Xien','Jalpa'],
        'score1':[62,47,55,74,32,77,86],
        'score2':[45,78,44,89,66,49,72]}
df3=pd.DataFrame(df1)

In [26]:
df3["diff"]=df3["score1"]-df3["score2"]

In [27]:
df3

      Name  score1  score2  diff
0   George      62      45    17
1   Andrea      47      78   -31
2  micheal      55      44    11
3   maggie      74      89   -15
4     Ravi      32      66   -34
5     Xien      77      49    28
6    Jalpa      86      72    14

#### 8) Drop two columns (C & D)from a dataframe

In [28]:
data = {
    'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
    'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
    'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
    'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
    'E': ['E1', 'E2', 'E3', 'E4', 'E5']}
df4=pd.DataFrame(data)

In [30]:
df4.drop(columns=["C","D"])

    A   B   E
0  A1  B1  E1
1  A2  B2  E2
2  A3  B3  E3
3  A4  B4  E4
4  A5  B5  E5

In [33]:
#Method 2 using indices
df4.drop(df4.columns[[2, 3]], axis=1)

    A   B   E
0  A1  B1  E1
1  A2  B2  E2
2  A3  B3  E3
3  A4  B4  E4
4  A5  B5  E5

In [36]:
#Method 3 using iloc
df4.drop(df4.iloc[:, 2:4],axis=1)

    A   B   E
0  A1  B1  E1
1  A2  B2  E2
2  A3  B3  E3
3  A4  B4  E4
4  A5  B5  E5

#### 9) Write a program to split Name into two columns in Pandas DataFrame

In [37]:
df = pd.DataFrame({'Name': ['a b', 'c d', 'e f'],
                    'Age':[32, 34, 36]})
df

  Name  Age
0  a b   32
1  c d   34
2  e f   36

In [42]:
df[["first","last"]]=df["Name"].str.split(expand=True)

In [45]:
df=df.drop(columns="Name")

In [46]:
df

   Age first last
0   32     a    b
1   34     c    d
2   36     e    f

#### 10)Write a program to Reorder the above columns as First,Last,age

In [58]:
df=df.iloc[:,[1,2,0]]

#### 11) Write a program to upperase "First" and 'Last' column in above df

In [59]:
df["first"]=df["first"].str.upper()
df["last"]=df["last"].str.upper()

In [60]:
df

  first last  Age
0     A    B   32
1     C    D   34
2     E    F   36

#### 12)Write a program to get the index position of maximum & minimum value in dataframe.

In [62]:
df["Age"].idxmax()

2

In [63]:
df["Age"].idxmin()

0

In [67]:
iris=pd.read_csv("iris.csv")
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

#### 13) Get frequency counts of different Species

In [68]:
iris["species"].value_counts()

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [70]:
iris.shape

(150, 5)

#### 14) Change columns data type in pandas

In [73]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': ['a', 'b', 'c', 'd', 'e']})

In [76]:
df=df.astype(str)

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      object
 1   B       5 non-null      object
dtypes: object(2)
memory usage: 212.0+ bytes

#### 15) Fetch the average marks of each class

In [79]:
student = {'Name': ['Ramesh', 'Suresh', 'Rajesh'], 'Class': ['A', 'B', 'A'], 'Marks': [85.10, 77.80, 91.54]}
student_df = pd.DataFrame(student)
student_df.head()

     Name Class  Marks
0  Ramesh     A  85.10
1  Suresh     B  77.80
2  Rajesh     A  91.54

In [87]:
student_df.groupby("Class")["Marks"].mean()

Class
A    88.32
B    77.80
Name: Marks, dtype: float64

#### 16) Create a list from rows in Pandas DataFrame

In [88]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3    13/2/11   Comedy   2000

In [105]:
Row_list =[]
  
# Iterate over each row
for i in range((df.shape[0])):
  
    # Using iloc to access the values of 
    # the current row denoted by "i"
    a=[]
    a.append(df.iloc[i, :])
    Row_list.append(a)
  

print(Row_list)

[[Date     10/2/2011
Event        Music
Cost         10000
Name: 0, dtype: object], [Date     11/2/2011
Event       Poetry
Cost          5000
Name: 1, dtype: object], [Date     12/2/2011
Event      Theatre
Cost         15000
Name: 2, dtype: object], [Date     13/2/11
Event     Comedy
Cost        2000
Name: 3, dtype: object]]

#### 17) Write a prog. to rank the students based on the marks scored.

In [106]:
student_details = {'Name':['Raj','IShan','Kalp','Rohan'],
                   'Subject':['Maths','Maths','Maths','Maths'],
                   'Marks':[80,60, 40, 60]
               }
df = pd.DataFrame(student_details)

In [109]:
df["rank"]=df["Marks"].rank(ascending=0)

In [110]:
df

    Name Subject  Marks  rank
0    Raj   Maths     80   1.0
1  IShan   Maths     60   2.5
2   Kalp   Maths     40   4.0
3  Rohan   Maths     60   2.5

#### 18) Get all rows in a Pandas DataFrame containing given substring

In [115]:
iris[iris["species"].str.contains("setosa")]

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.2  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.6           1.4          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa
40           5.0          3.5           1.3          0.3  setosa
41           4.5          2.3           1.3          0.3  setosa
42           4.4          3.2           1.3          0.2  setosa
43           5.0          3.5           1.6          0.6  setosa
44           5.1          3.8           1.9          0.4  setosa
45           4.8          3.0           1.4          0.3  setosa
46           5.1          3.8           1.6          0.2  setosa
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

#### 19)Get n-smallest values from a particular column in Pandas DataFrame

In [118]:
iris.nsmallest(3,"sepal_length")

    sepal_length  sepal_width  petal_length  petal_width species
13           4.3          3.0           1.1          0.1  setosa
8            4.4          2.9           1.4          0.2  setosa
38           4.4          3.0           1.3          0.2  setosa

#### 20) Write a prog to add additional column to an existing df.

In [119]:
initial_data = {'First_name': ['Ram', 'Mohan', 'Tina', 'Jeetu', 'Meera'], 
        'Last_name': ['Kumar', 'Sharma', 'Ali', 'Gandhi', 'Kumari'], 
        'Age': [42, 52, 36, 21, 23], 
        'City': ['Mumbai', 'Noida', 'Pune', 'Delhi', 'Bihar']}
df = pd.DataFrame(initial_data, columns = ['First_name', 'Last_name',
                                                      'Age', 'City'])
df

  First_name Last_name  Age    City
0        Ram     Kumar   42  Mumbai
1      Mohan    Sharma   52   Noida
2       Tina       Ali   36    Pune
3      Jeetu    Gandhi   21   Delhi
4      Meera    Kumari   23   Bihar

In [123]:
new_data = { "Ram":"B.Com",
             "Mohan":"IAS",
             "Jeetu":"B.Tech",
             "Tina":"LLB",
             "Meera":"MBBS" }
df["qualification"]=df["First_name"].map(new_data)

In [124]:
df

  First_name Last_name  Age    City qualification
0        Ram     Kumar   42  Mumbai         B.Com
1      Mohan    Sharma   52   Noida           IAS
2       Tina       Ali   36    Pune           LLB
3      Jeetu    Gandhi   21   Delhi        B.Tech
4      Meera    Kumari   23   Bihar          MBBS